{
  "backend/main.mo": "Implements access control, user approval, and user profile storage with admin-restricted role and approval management.",
  "feature_evidence.json": "Defines feature evidence entries linking build and documentation updates to component versions and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files used in the Word Hunt game and build process.",
  "frontend/ANDROID_APK.md": "Documentation covering prerequisites and steps to build debug and release Android APKs using TWA or Capacitor.",
  "frontend/android-apk-output/.gitignore": "Ignores APKs, AABs, logs, and temporary build files in the output directory.",
  "frontend/android-apk-output/.gitkeep": "Empty placeholder file ensuring the output directory is tracked by Git.",
  "frontend/android/.gitignore": "Android-specific gitignore rules covering build outputs, temp files, IDE files, keystores, and Capacitor assets.",
  "frontend/android/app/build.gradle": "Gradle config for the Android app, defining SDK versions, build types, Java 17 compatibility, and Capacitor dependencies.",
  "frontend/android/app/capacitor.build.gradle": "Generated Capacitor build file enforcing Java 17 and applying Cordova plugin variables.",
  "frontend/android/app/proguard-rules.pro": "ProGuard configuration preserving all classes under com.wordhunt.game.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Manifest defining app metadata, main activity, FileProvider, and required permissions.",
  "frontend/android/app/src/main/java/com/wordhunt/game/MainActivity.java": "Main Capacitor BridgeActivity entry point for the Android application.",
  "frontend/android/app/src/main/res/drawable/splash.xml": "Splash screen layout combining a background color and centered launcher icon.",
  "frontend/android/app/src/main/res/values/colors.xml": "Color resource definitions for primary, dark, and accent theme colors.",
  "frontend/android/app/src/main/res/values/strings.xml": "String resources containing app name, activity title, package name, and URL scheme.",
  "frontend/android/app/src/main/res/values/styles.xml": "Defines base and no-action-bar themes plus a launch splash theme.",
  "frontend/android/app/src/main/res/xml/file_paths.xml": "FileProvider path configuration allowing access to cache, external files, and external storage.",
  "frontend/android/build.gradle": "Top-level Gradle config setting repositories, buildscript dependencies, and a clean task.",
  "frontend/android/capacitor-cordova-android-plugins/build.gradle": "Build config for Capacitor Cordova plugin bundle with Java 17 and standard Android library settings.",
  "frontend/android/capacitor-cordova-android-plugins/cordova.variables.gradle": "Generated variables file defining Cordova-related SDK and version settings.",
  "frontend/android/capacitor.settings.gradle": "Generated settings file including Capacitor modules and linking them to node_modules paths.",
  "frontend/android/gradle.properties": "Defines Gradle and Android build settings including JVM args, AndroidX flags, Flipper version, ABI filters, and Hermes engine toggle.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Configures the Gradle wrapper distribution, pointing to Gradle 8.4.",
  "frontend/android/gradlew": "POSIX shell script that launches the Gradle wrapper for building the Android project.",
  "frontend/android/gradlew.bat": "Windows batch script for executing the Gradle wrapper.",
  "frontend/android/settings.gradle": "Includes app modules and applies Capacitor Android settings.",
  "frontend/android/variables.gradle": "Defines Android SDK versions and library dependency versions used in the build.",
  "frontend/capacitor.config.ts": "Capacitor config defining app metadata, web directory, Android scheme, and build options.",
  "frontend/index.css": "Tailwind CSS setup plus theme variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry including PWA manifest, icons, metadata, and bootstrapping the app.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app name, icons, theme, display mode, and categories.",
  "frontend/scripts/build-android-apk.sh": "Shell script automating web build and Android APK generation for debug or release.",
  "frontend/src/App.tsx": "Root React component rendering the WordHuntScreen inside a styled container.",
  "frontend/src/components/game/DifficultySelector.tsx": "Empty placeholder component file.",
  "frontend/src/components/game/GameControls.tsx": "React component providing UI for progress display, timer, and time‑limit settings.",
  "frontend/src/components/game/LetterGrid.tsx": "Renders the interactive letter grid, handling pointer-based selection and highlighting found or selected cells.",
  "frontend/src/components/game/WordHuntScreen.tsx": "Provides the main Word Hunt UI with header, controls, timer handling, puzzle grid, and word list.",
  "frontend/src/components/game/WordList.tsx": "Displays the word list, sorting and styling words based on whether they are found.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity login, stored identity restoration, and provides identity context to the app.",
  "frontend/src/hooks/useWordHuntGame.ts": "Implements game state, puzzle generation, timer logic, and word selection validation for Word Hunt.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables, including light and dark mode palettes.",
  "frontend/src/lib/wordhunt/duration.ts": "Provides utilities for converting, validating, and clamping countdown timer durations.",
  "frontend/src/lib/wordhunt/generator.ts": "Generates a word-hunt puzzle by placing shuffled words onto a grid and filling remaining cells with random letters.",
  "frontend/src/lib/wordhunt/selection.ts": "Handles determining selected cells in a straight line and validating whether the selected letters form a valid word.",
  "frontend/src/lib/wordhunt/time.ts": "Provides a utility to format seconds into MM:SS time strings.",
  "frontend/src/lib/wordhunt/words.ts": "Exports the full automotive-themed word list used for puzzle generation.",
  "frontend/src/main.tsx": "Bootstraps the React app using ReactDOM with QueryClient and InternetIdentity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, animations, and plugins.",
  "project_state.json": "Stores project metadata including version, architectural notes, features, and build status."
}