{
  "backend/main.mo": "Motoko canister managing user profiles with access control, approval workflow, and admin‑restricted role management.",
  "feature_evidence.json": "Feature evidence report describing APK generation workflow and associated files, components, and tests.",
  "frontend-file-summaries.txt": "List of human‑written summaries for all frontend source files and assets.",
  "frontend/ANDROID_APK.md": "Comprehensive guide for building, signing, and publishing the Android APK including prerequisites and troubleshooting.",
  "frontend/android-apk-output/.gitignore": "Gitignore rules excluding APK artifacts and temporary files in the APK output directory.",
  "frontend/android-apk-output/.gitkeep": "Keeps the otherwise empty APK output directory in version control.",
  "frontend/android/.gitignore": "Gitignore for Android project artifacts, build outputs, IDE files, keystores, and sensitive configs.",
  "frontend/android/app/build.gradle": "Gradle app module config defining SDK versions, signing logic, build types, and asset rules.",
  "frontend/android/app/capacitor.build.gradle": "Generated Capacitor build config setting Java 17 compatibility and plugin variables.",
  "frontend/android/app/proguard-rules.pro": "ProGuard rules keeping all com.wordhunt.game classes and providing optional debugging settings.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest defining app metadata, main activity, FileProvider, and required permissions.",
  "frontend/android/app/src/main/java/com/wordhunt/game/MainActivity.java": "MainActivity extending Capacitor BridgeActivity for the Android app.",
  "frontend/android/app/src/main/res/drawable/splash.xml": "Splash screen drawable showing a primary color background with centered launcher icon.",
  "frontend/android/app/src/main/res/values/colors.xml": "Defines primary, dark primary, and accent colors for the Android theme.",
  "frontend/android/app/src/main/res/values/strings.xml": "Resource strings for app name, title, package name, and custom URL scheme.",
  "frontend/android/app/src/main/res/values/styles.xml": "App theme definitions including action‑bar and splash‑screen variants.",
  "frontend/android/app/src/main/res/xml/file_paths.xml": "FileProvider path configuration allowing cached and external file access.",
  "frontend/android/build.gradle": "Top‑level Gradle build file configuring repositories, plugin versions, and the clean task.",
  "frontend/android/capacitor-cordova-android-plugins/build.gradle": "Gradle config for Capacitor Cordova plugin module with SDK settings and dependencies.",
  "frontend/android/capacitor-cordova-android-plugins/cordova.variables.gradle": "Generated Cordova variables defining min/compile/target SDK versions.",
  "frontend/android/capacitor.settings.gradle": "Generated Capacitor settings including module includes for all Capacitor plugins.",
  "frontend/android/gradle.properties": "Configures Gradle JVM settings, AndroidX support, Flipper version, CPU ABI filters, new architecture flag, and Hermes engine usage.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Defines Gradle wrapper distribution settings pointing to Gradle 8.4.",
  "frontend/android/gradlew": "POSIX shell script to launch the Gradle wrapper using the system JVM.",
  "frontend/android/gradlew.bat": "Windows batch script for launching the Gradle wrapper.",
  "frontend/android/settings.gradle": "Includes the app module and Capacitor Cordova plugins, and applies Capacitor settings.",
  "frontend/android/signing.properties.example": "Example template for configuring Android release keystore signing credentials.",
  "frontend/android/variables.gradle": "Defines Android build SDK versions and dependency version variables.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web directory, Android scheme, and build options.",
  "frontend/index.css": "Tailwind CSS setup defining base layers and theme variables for light and dark modes.",
  "frontend/index.html": "App entry HTML setting metadata, PWA manifest, icons, and loading the main React module.",
  "frontend/public/downloads/.gitkeep": "Placeholder to keep the downloads directory for APK publication.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and categories.",
  "frontend/scripts/build-android-apk.sh": "Bash script to build debug or release Android APKs with optional signing and publish outputs.",
  "frontend/src/App.tsx": "Main React component rendering the WordHuntScreen inside a full-height container.",
  "frontend/src/components/game/DifficultySelector.tsx": "Empty placeholder component file for selecting game difficulty.",
  "frontend/src/components/game/GameControls.tsx": "React component showing progress, timer, and inputs to adjust time limits with callbacks.",
  "frontend/src/components/game/LetterGrid.tsx": "Renders the interactive letter grid, handling pointer selection and highlighting found or selected cells.",
  "frontend/src/components/game/WordHuntScreen.tsx": "Main game screen managing puzzle lifecycle, timer, APK availability check, and rendering grid, word list, and controls.",
  "frontend/src/components/game/WordList.tsx": "Displays a sortable list of words and visually marks those already found.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login/logout logic, session handling, and context for identity state.",
  "frontend/src/hooks/useWordHuntGame.ts": "Manages Word Hunt game state, including puzzle generation, selection logic, found words, and countdown timer.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light/dark theme tokens and global styling.",
  "frontend/src/lib/wordhunt/duration.ts": "Utility functions for parsing, converting, validating, and clamping game duration values.",
  "frontend/src/lib/wordhunt/generator.ts": "Generates a word-hunt puzzle by placing words randomly into a grid and filling remaining cells with random letters.",
  "frontend/src/lib/wordhunt/selection.ts": "Provides logic for selecting contiguous grid cells, converting them to words, and validating matches.",
  "frontend/src/lib/wordhunt/time.ts": "Formats a number of seconds into MM:SS with clamping at zero.",
  "frontend/src/lib/wordhunt/words.ts": "Exports a fixed list of automotive-themed words used for puzzle generation.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, plugins, and animations for the project.",
  "project_state.json": "Defines the project’s current build state, notes, features, and known issues for the Word Hunt Game app."
}