{
  "backend/main.mo": "Actor providing user approval, role-based access control, and profile storage with admin-gated management functions.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Lists summaries of all frontend source files and build assets.",
  "frontend/ANDROID_APK.md": "Guide explaining how to build the Android APK using Bubblewrap TWA or Capacitor with prerequisites and steps.",
  "frontend/android-apk-output/.gitignore": "Ignores built APKs, AABs, logs, and temp files in the APK output directory.",
  "frontend/android-apk-output/.gitkeep": "Placeholder file to keep the APK output directory in version control.",
  "frontend/android/.gitignore": "Android-specific gitignore covering Gradle output, IDE files, APKs, and Capacitor assets.",
  "frontend/android/app/build.gradle": "Android app module configuration using Java 17, Capacitor plugins, and standard build settings.",
  "frontend/android/app/capacitor.build.gradle": "Generated Capacitor build file enforcing Java 17 settings and plugin variables.",
  "frontend/android/app/proguard-rules.pro": "ProGuard rules preserving Word Hunt Game classes for release builds.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest defining the app activity, FileProvider, permissions, and icons.",
  "frontend/android/app/src/main/java/com/wordhunt/game/MainActivity.java": "Main Capacitor BridgeActivity entry point with default onCreate.",
  "frontend/android/app/src/main/res/drawable/splash.xml": "Splash screen layer-list showing a primary color background and centered icon.",
  "frontend/android/app/src/main/res/values/colors.xml": "Defines primary, dark primary, and accent colors for the Android theme.",
  "frontend/android/app/src/main/res/values/strings.xml": "App string resources including name, titles, and package identifiers.",
  "frontend/android/app/src/main/res/values/styles.xml": "Defines base themes, no-action-bar variants, and splash launch theme.",
  "frontend/android/app/src/main/res/xml/file_paths.xml": "FileProvider path configuration enabling cached and external file sharing.",
  "frontend/android/build.gradle": "Top-level Gradle config with plugin versions, repositories, and clean task.",
  "frontend/android/capacitor-cordova-android-plugins/build.gradle": "Build config for Capacitor Cordova plugin module using Java 17 and plugin dependencies.",
  "frontend/android/capacitor-cordova-android-plugins/cordova.variables.gradle": "Generated Capacitor variables file defining SDK versions and Cordova settings.",
  "frontend/android/capacitor.settings.gradle": "Generated Capacitor settings including all Capacitor plugin modules.",
  "frontend/android/gradle.properties": "Global Gradle settings enabling AndroidX, Jetifier, memory limits, and build architecture filters.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Specifies Gradle wrapper configuration using Gradle 8.4.",
  "frontend/android/gradlew": "POSIX shell script used to launch the Gradle wrapper for building the Android project.",
  "frontend/android/gradlew.bat": "Windows batch script that runs the Gradle wrapper for the Android build.",
  "frontend/android/settings.gradle": "Defines included Android modules and applies Capacitor settings.",
  "frontend/android/variables.gradle": "Holds Android SDK versions and dependency version variables for the Gradle build.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web directory, and Android build options.",
  "frontend/index.css": "Tailwind CSS setup defining global styles, color variables, and dark mode tokens.",
  "frontend/index.html": "Main HTML entry for the web app, loading the PWA manifest and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing the app name, icons, theme, and display mode.",
  "frontend/scripts/build-android-apk.sh": "Bash script that validates environment prerequisites and builds the Android APK using Capacitor and Gradle.",
  "frontend/src/App.tsx": "Root React component that renders the WordHuntScreen inside a full‑height container.",
  "frontend/src/components/game/DifficultySelector.tsx": "Placeholder component file with no implemented content.",
  "frontend/src/components/game/GameControls.tsx": "React component rendering progress, timer, and time‑limit inputs for game control.",
  "frontend/src/components/game/LetterGrid.tsx": "Renders the interactive letter grid, handling pointer selection and highlighting found or selected cells.",
  "frontend/src/components/game/WordHuntScreen.tsx": "Main game screen that initializes game state, renders controls, grid, and word list, and manages timing and new games.",
  "frontend/src/components/game/WordList.tsx": "Displays the list of words to find, sorted with found words marked and styled.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identity and offering login and logout handling.",
  "frontend/src/hooks/useWordHuntGame.ts": "Manages word hunt gameplay state, including puzzle generation, selection logic, found words, and countdown timer.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/wordhunt/duration.ts": "Utility functions for converting, validating, and clamping countdown timer durations.",
  "frontend/src/lib/wordhunt/generator.ts": "Generates a word-hunt puzzle by placing words on a grid in random directions and filling remaining cells with random letters.",
  "frontend/src/lib/wordhunt/selection.ts": "Computes selected grid cells, derives the selected word, and validates it against remaining words.",
  "frontend/src/lib/wordhunt/time.ts": "Formats a seconds value into a MM:SS string with clamping at zero.",
  "frontend/src/lib/wordhunt/words.ts": "Exports the full automotive-themed word list used for puzzle generation.",
  "frontend/src/main.tsx": "Initializes React, sets up providers, and renders the main App component.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, plugins, colors, and animations for the project.",
  "project_state.json": "Stores project metadata, versioned state, architectural notes, and tracked feature requirements."
}