{
  "kind": "build_request",
  "title": "Retry Android APK packaging by ensuring the latest APK is published and verifiably available at /downloads/word-hunt-latest.apk",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Update the one-command Android APK build script (`frontend/scripts/build-android-apk.sh`) to publish the newly built APK to the deployed web asset path so that the deployed site serves the file at `/downloads/word-hunt-latest.apk` (i.e., ensure the build output contains `frontend/dist/downloads/word-hunt-latest.apk` and that the repo static directory `frontend/public/downloads/word-hunt-latest.apk` is also kept in sync if it is used by the deployment pipeline).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "yes, try again"
        ]
      },
      "acceptanceCriteria": [
        "After running `frontend/scripts/build-android-apk.sh`, the file `frontend/dist/downloads/word-hunt-latest.apk` exists.",
        "The published APK filename in the web build output is exactly `word-hunt-latest.apk` under the `downloads/` directory.",
        "If the project’s deployment serves static assets from `frontend/public/`, then `frontend/public/downloads/word-hunt-latest.apk` is also created/updated to match the newly built APK.",
        "The resulting deployed site serves the APK at the URL path `/downloads/word-hunt-latest.apk` (HTTP 200 or 206 for ranged requests)."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Add a fail-fast verification step at the end of `frontend/scripts/build-android-apk.sh` that checks the published APK exists and is non-empty at `frontend/dist/downloads/word-hunt-latest.apk` (and, if applicable, `frontend/public/downloads/word-hunt-latest.apk`), and prints clear English instructions if the file is missing so APK packaging retries do not silently succeed while the download remains unavailable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "yes, try again"
        ]
      },
      "acceptanceCriteria": [
        "If `frontend/dist/downloads/word-hunt-latest.apk` is missing (or zero bytes), the script exits non-zero and prints an English error message that includes the expected path(s).",
        "If the publish step succeeds, the script prints an English success message that includes the final published path `frontend/dist/downloads/word-hunt-latest.apk` and the corresponding URL path `/downloads/word-hunt-latest.apk`."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Ensure the in-app APK availability check results in the Word Hunt screen showing the download control once `/downloads/word-hunt-latest.apk` is present, so that a successful packaging retry makes the \"Download APK\" button visible without any manual client-side steps.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "yes, try again"
        ]
      },
      "acceptanceCriteria": [
        "When `/downloads/word-hunt-latest.apk` is available on the deployed site, the Word Hunt header displays the download button labeled in English (\"Download APK\" on larger screens, \"APK\" on small screens).",
        "When `/downloads/word-hunt-latest.apk` is not available, the download button is not shown."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (read-only UI primitives).",
    "Do not introduce additional backend canisters or databases; keep the existing single-actor Motoko backend unchanged unless strictly necessary for APK publishing (it should not be necessary).",
    "All user-facing text related to the APK/download flow must be in English."
  ],
  "nonGoals": [
    "Changing Word Hunt gameplay mechanics, grid generation, word list, or timer behavior.",
    "Adding new authentication providers beyond Internet Identity.",
    "Implementing a new download endpoint in the Motoko backend (APK must remain a static web asset)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}